#### [`repos-official-new`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-4ctN2CwSwgJyNqr3" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
[command]/home/runner/work/_temp/f6d7b527-2ab3-4bc3-b806-c29bc135b77c/terraform-bin plan -no-color
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-official-new/runs/run-4ctN2CwSwgJyNqr3

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
data.github_team.reposofficialnew_cdktfteamcdktf_4A2C9F8E: Reading...
data.github_team.reposofficialnew_cdktfteamhashicorp_2FBDEDDB: Reading...
data.github_team.reposofficialnew_cdktfteamhashicorp_2FBDEDDB: Read complete after 1s [id=3949435]
data.github_team.reposofficialnew_cdktfteamcdktf_4A2C9F8E: Read complete after 7s [id=6602018]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_actions_secret.reposofficialnew_cdktfproviderad_repo_secretnpmtoken_2FE1C3B3 must be replaced
-/+ resource "github_actions_secret" "reposofficialnew_cdktfproviderad_repo_secretnpmtoken_2FE1C3B3" {
      ~ created_at      = "2022-10-05 14:10:04 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "cdktf-provider-ad:NPM_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-10-05 14:10:04 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderazurestack_repo_secretnpmtoken_F3160023 must be replaced
-/+ resource "github_actions_secret" "reposofficialnew_cdktfproviderazurestack_repo_secretnpmtoken_F3160023" {
      ~ created_at      = "2022-10-05 14:11:58 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "cdktf-provider-azurestack:NPM_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-10-05 14:11:58 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderboundary_repo_secretnpmtoken_E9A871DA must be replaced
-/+ resource "github_actions_secret" "reposofficialnew_cdktfproviderboundary_repo_secretnpmtoken_E9A871DA" {
      ~ created_at      = "2022-10-05 14:15:06 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "cdktf-provider-boundary:NPM_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-10-05 14:15:06 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderconsul_repo_secretnpmtoken_D4CACB5B must be replaced
-/+ resource "github_actions_secret" "reposofficialnew_cdktfproviderconsul_repo_secretnpmtoken_D4CACB5B" {
      ~ created_at      = "2022-10-05 14:13:04 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "cdktf-provider-consul:NPM_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-10-05 14:13:04 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderdns_repo_secretnpmtoken_B03550A4 must be replaced
-/+ resource "github_actions_secret" "reposofficialnew_cdktfproviderdns_repo_secretnpmtoken_B03550A4" {
      ~ created_at      = "2022-10-05 14:09:33 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "cdktf-provider-dns:NPM_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-10-05 14:09:33 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.reposofficialnew_cdktfprovidergoogleworkspace_repo_secretnpmtoken_225C717D must be replaced
-/+ resource "github_actions_secret" "reposofficialnew_cdktfprovidergoogleworkspace_repo_secretnpmtoken_225C717D" {
      ~ created_at      = "2022-10-05 14:11:15 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "cdktf-provider-googleworkspace:NPM_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-10-05 14:11:15 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderhcp_repo_secretnpmtoken_29427564 must be replaced
-/+ resource "github_actions_secret" "reposofficialnew_cdktfproviderhcp_repo_secretnpmtoken_29427564" {
      ~ created_at      = "2022-10-05 14:13:31 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "cdktf-provider-hcp:NPM_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-10-05 14:13:31 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderhcs_repo_secretnpmtoken_8D46C8CA must be replaced
-/+ resource "github_actions_secret" "reposofficialnew_cdktfproviderhcs_repo_secretnpmtoken_8D46C8CA" {
      ~ created_at      = "2022-10-05 14:15:41 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "cdktf-provider-hcs:NPM_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-10-05 14:15:41 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.reposofficialnew_cdktfproviderhttp_repo_secretnpmtoken_E1F65B03 must be replaced
-/+ resource "github_actions_secret" "reposofficialnew_cdktfproviderhttp_repo_secretnpmtoken_E1F65B03" {
      ~ created_at      = "2022-10-05 14:11:04 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "cdktf-provider-http:NPM_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-10-05 14:11:04 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.reposofficialnew_cdktfprovidernomad_repo_secretnpmtoken_EB102F69 must be replaced
-/+ resource "github_actions_secret" "reposofficialnew_cdktfprovidernomad_repo_secretnpmtoken_EB102F69" {
      ~ created_at      = "2022-10-05 14:14:10 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "cdktf-provider-nomad:NPM_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-10-05 14:14:10 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.reposofficialnew_cdktfprovideropc_repo_secretnpmtoken_491C8E3D must be replaced
-/+ resource "github_actions_secret" "reposofficialnew_cdktfprovideropc_repo_secretnpmtoken_491C8E3D" {
      ~ created_at      = "2022-10-05 14:14:49 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "cdktf-provider-opc:NPM_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-10-05 14:14:49 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.reposofficialnew_cdktfprovideroraclepaas_repo_secretnpmtoken_EC21CF70 must be replaced
-/+ resource "github_actions_secret" "reposofficialnew_cdktfprovideroraclepaas_repo_secretnpmtoken_EC21CF70" {
      ~ created_at      = "2022-10-05 14:14:31 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "cdktf-provider-oraclepaas:NPM_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-10-05 14:14:31 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.reposofficialnew_cdktfprovidersalesforce_repo_secretnpmtoken_BEDED0C0 must be replaced
-/+ resource "github_actions_secret" "reposofficialnew_cdktfprovidersalesforce_repo_secretnpmtoken_BEDED0C0" {
      ~ created_at      = "2022-10-05 14:12:26 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "cdktf-provider-salesforce:NPM_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-10-05 14:12:26 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.reposofficialnew_cdktfprovidervsphere_repo_secretnpmtoken_FBDFFD75 must be replaced
-/+ resource "github_actions_secret" "reposofficialnew_cdktfprovidervsphere_repo_secretnpmtoken_FBDFFD75" {
      ~ created_at      = "2022-10-05 14:10:33 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "cdktf-provider-vsphere:NPM_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-10-05 14:10:33 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 14 to add, 0 to change, 14 to destroy.

::debug::Terraform exited with code 0.
::debug::stderr: 
::debug::exitcode: 0


::set-output name=stderr::

::set-output name=exitcode::0

```

</details>

*Pusher: @mutahhir, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*